"""Life PS"""
def main():
    """Version A1"""
    print("สวัสดี ยินดีต้อนรับสู่โปรแกรมตอบถามสิ่งที่พบเจอและแนะนำวิธีแก้ไขเบื้องต้นแบบไม่ต้องพึ่งพาระบบอินเตอร์เน็ต")
    lifeps = input("คำถามที่ถูกถามบ่อย \nพิมพ์ 1 เกี่ยวกับอาการป่วยพื้นฐาน \nพิมพ์ 2 สำหรับเรื่องน้ำหนัก \
    (วิธีเพิ่ม, ลดน้ำหนัก, คำนวนดัชณีมวลกาย) \nพิมพ์ 3 ปัญหามือถือต่างๆและวิธีแก้ไขเบื้องต้น \
    \nพิมพ์ เพิ่มเติม เพื่อดูปัญหาหาอื่นๆ\nโปรดระบุปัญหาของท่านตามที่ระบุไว้: ")
    lifeps1 = lifeps.upper()
    if lifeps1 == "1":
        return health()
    elif lifeps1 == "2": #ปัญหาน้ำหนักและคำนวณน้ำหนัก
        return weight()
    elif lifeps1 == "MORE" or lifeps == "เพิ่ม" or lifeps == "เติม":
        return moreps()
    elif lifeps1 == "3":
        return spfix()
def health():
    """โปรแกรมเกี่ยวกับปัญหาสุขภาพเบื้องต้น"""
    print("**เป็นโปรแกรมที่บอกวิธีการแก้ไขอาการเบื่้องต้นเท่านั้น\
หากท่านไม่รู้สึกดีขึ้นจากการปฏิบัติตามการแก้ไขเบื้องต้น รีบไปปรึกแพทย์ผู้เชี่ยวชาญ**")
    sick = input("สวัสดีวันนี้เป็นอะไรมา \nปวดหัว เป็นไข้ ปวดท้อง ท้องเสีย เป็นต้น หรือ\
พิมพ์ ออก เพื่อออกจากโปรแกรม\nโปรดระบุอาการของท่าน: ")
    if sick == "ปวดหัว":
        headache1 = input("ปวดหัวข้างเดียว, ปวดที่กระบอกตา เป็นต้น")
        if headache1.count("ข้างเดียว") or headache1.count("เดียว"):
            print("อาการหัวข้างเดียวอาจเกิดจากโรคไมเกรน ซึ่งโดยทั่วไปแล้วยาแก้ปวดธรรมดาแบบพาราเซตามอลมักใช้ไม่ได้ผลกับการปวดหัวแบบไมเกรน\
            \nต้องใช้ยาแก้ปวดที่แรงขึ้น เพราะฉะนั้นควรปรึกษาแพทย์เพื่อสั่งยาให้จะดีกว่า อีกอย่างหนึ่งก็คือ หากมีอาการปวดหัวจากไมเกรนบ่อยๆ\
แพทย์จะสามารถแนะนำให้กินยาป้องกัน")
        elif headache1.count("กระบอก") or headache1.count("ตา"):
            print("อาการปวดหัวที่กระบอกตา เกิดได้จากหลายสาเหตุ แต่โดยทั่วไป เกิดจากการที่กล้ามเนื้อตาล้า บรรเทาได้โดยการนวดเบ้าตาและขมับด้วยนิ้วมือ\
หรือการประคบร้อนบริเวณดวงตาเพื่อให้ระบบไหลเวียนเลือดดีขึ้น กระพริบตาบ่อยๆ กรอกตาไปมา จนกว่าจะหายปวด")
def weight():
    """โปรแกรมเกี่ยวกับน้ำหนัก มวลร่างกาย"""
    urproblem = input("วิธีเพิ่มน้ำหนัก, วิธีบดน้ำหนัก, คำนวนดัชณีมวลกาย (BMI), หากไม่มีจากที่กล่าวมาพิมพ์ (ออก) \
    \nโปรดระบุ : ") 
    urproblem1 = urproblem.upper()
    if urproblem1.count("BMI") or urproblem.count("ดัชนี"): #BMI Calculator
        urweight = float(input("โปรดระบุน้ำหนักของท่าน (กิโลกรัม):"))
        urheight = float(input("โปรดระบุความสูงของท่าน (เซนติเมตร):"))
        urgender = input("โปรดระบุเพศของท่าน (ชาย หรือ หญิง):")
        urgender1 = urgender.lower()
        if urgender1 == "ชาย" or urgender1 == "หญิง":
            bmi = urweight/((urheight/100)**2)
            if bmi < 18.5:
                print("ผอม")
            elif bmi >= 18.5 and bmi <= 22.9:
                print("น้ำหนักปกติ")
            elif bmi >= 23.00 and bmi <= 24.9:
                print("น้ำหนักเกิน")
            elif bmi >= 25.0 and bmi <= 30.0:
                print("อ้วน")
            elif bmi > 30.0:
                print("อ้วนมาก")
            print("##ค่าดัชนีมวลกายคนเอเชีย")
        elif urproblem1.count("เพิ่ม"):
            print("รับประทานอาหารให้มากกว่าปกติ เน้นอาหารจำพวกโปรตีน ออกกำลังกายประเภท Body Weight เพื่อช่วยสร้างกล้ามเนื้อร่างกาย")
    elif urproblem1.count("ออก") or urproblem1.count("EXIT"): #ออกจากโปรแกรมน้ำหนัก
        return main()
    else:
        print("โปรดระบุสิ่งที่ท่านต้องการทราบในโปรแกรมเกี่ยวกับน้ำหนัก หากไม่มีหรือไม่ต้องการโปรดพิมพ์ ออก")
        if urproblem.count("ออก"):
            return main()
        else:
            return weight()
def spfix():
    spfixpro = input("โปรดระบุแบรนด์มือถือที่ท่านใช้งาน(เป็นภาษาอังกฤษ): ")
    spfixprolo = spfixpro.lower()
    if spfixprolo.count("xiaomi") or spfixprolo.count("redmi") or spfixprolo.count("mi"):
        miprob = input("โปรดระบุปัญหาที่ท่านพบเจอ เช่น เครื่องช้า เปิดไม่ติด bootloop เป็นต้น")
    elif spfixprolo.count("samsung"):
        samprob = input("โปรดระบุปัญหาที่ท่านพบเจอ เช่น เครื่องช้า เปิดไม่ติด เป็นต้น")
    elif spfixprolo.count("huawei") or spfixprolo.count("honor"):
        huawprob = input("โปรดระบุปัญหาที่ท่านพบเจอ เช่น เครื่องช้า เปิดไม่ติด เป็นต้น")
    else:
        otherbrand = input("ไม่พบแบรนด์ที่ท่าระบุมา โปรดระบุปัญหาที่ท่านพบเจอ เช่น เครื่องช้า เป็นต้น")
main()

