"""Life PS"""
def main():
    """Version A1"""
    print("สวัสดี ยินดีต้อนรับสู่โปรแกรมตอบถามสิ่งที่พบเจอและแนะนำวิธีแก้ไขเบื้องต้นแบบไม่ต้องพึ่งพาระบบอินเตอร์เน็ต")
    lifeps = input("คำถามที่ถูกถามบ่อย \nพิมพ์ 1 เกี่ยวกับอาการป่วยพื้นฐาน \nพิมพ์ 2 สำหรับเรื่องน้ำหนัก \
    (วิธีเพิ่ม, ลดน้ำหนัก, คำนวนดัชณีมวลกาย) \nพิมพ์ 3 ปัญหามือถือต่างๆและวิธีแก้ไขเบื้องต้น \
    \nพิมพ์ เพิ่มเติม เพื่อดูปัญหาหาอื่นๆ\nโปรดระบุปัญหาของท่านตามที่ระบุไว้: ")
    lifeps1 = lifeps.upper()
    if lifeps1 == "1":
        return health()
    elif lifeps1 == "2": #ปัญหาน้ำหนักและคำนวณน้ำหนัก
        return weight()
    elif lifeps1 == "MORE" or lifeps == "เพิ่ม" or lifeps == "เติม":
        return moreps()
    elif lifeps1 == "3":
        return spfix()
main()